examples/tobias_tutorial/fan_rotation_ncc/templates/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           20;

maxDeltaT	0.0025;

libs ("libsolverFunctionObjects.so");

functions
{
    passiveScalar
    {
        type            scalarTransport;
        field           T;
        diffusivity     viscosity;
        alphal          1;          // multiplier to alpha laminar
        alphat          1;          // multiplier to alpha turbulent 
        schemesField    T;
        nCorr           0;
        resetOnStartUp  false;
    }
}

// ************************************************************************* //
